## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| add    | `aws_route53_record._acme-challenge-census-alpha-canada-ca-CNAME`      |
|        | `aws_route53_record._acme-challenge-recensement-alpha-canada-ca-CNAME` |
|        | `aws_route53_record.census-alpha-canada-ca-CNAME`                      |
|        | `aws_route53_record.recensement-alpha-canada-ca-CNAME`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record._acme-challenge-census-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "_acme-challenge-census-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_acme-challenge.census.alpha.canada.ca"
      + records         = [
          + "census.alpha.canada.ca.challenges.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record._acme-challenge-recensement-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "_acme-challenge-recensement-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_acme-challenge.recensement.alpha.canada.ca"
      + records         = [
          + "recensement.alpha.canada.ca.challenges.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.census-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "census-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "census.alpha.canada.ca"
      + records         = [
          + "census-cws.prod.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.recensement-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "recensement-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "recensement.alpha.canada.ca"
      + records         = [
          + "census-cws.prod.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
